In [4]:
import pandas as pd
%matplotlib notebook
from IPython.display import display, HTML

In [15]:
test = pd.read_csv('data/test_final.csv')
train = pd.read_csv('data/train_final.csv')

print(df.shape)
display(df.head())
print(df2.shape)
display(df2.head())

(16385, 25)

,id,F1,F2,F3,F4,F5,F6,F7,F8,F9,...,F15,F16,F17,F18,F19,F20,F21,F22,F23,F24
0,16384,27991,135396,0,33,120578,17000,143022,1,124156,...,1,128168,121276,1,122084,1,1,127696,1,36129
1,16385,82444,54655,0,38,120064,18000,315517,1,123643,...,1,121648,120763,1,119703,1,2,127441,1,90582
2,16386,37950,23477,1,27,120267,1000,142929,1,123845,...,1,314350,120965,1,119703,1,1,127029,1,46088
3,16387,75000,92055,0,33,118844,2000,130186,1,183832,...,1,140144,180952,1,118961,1,1,127973,1,83138
4,16388,84243,8156,0,40,136613,2000,132071,1,139841,...,1,121642,136961,1,118832,1,1,126927,1,92381

(16383, 29)

,id,Y,F1,F2,F3,F4,F5,F6,F7,F8,...,F18,F19,F20,F21,F22,F23,F24,F25,F26,F27
0,1,1,38733,61385,0,38,118751,1000,32020,1,...,1,118830,1,1,126461,1,46871,NaN,NaN,NaN
1,2,1,34248,51329,0,41,120800,1000,130630,1,...,1,118832,1,1,130296,1,42386,NaN,NaN,NaN
2,3,1,15830,5522,0,50,118779,1000,303218,2,...,1,118832,1,2,127063,1,23968,NaN,NaN,NaN
3,4,1,19417,6754,0,45,123163,2000,19024,1,...,1,118832,1,1,15274,1,27555,NaN,NaN,NaN
4,5,1,42122,16991,0,41,119193,1000,303218,1,...,1,118832,1,1,133491,1,50260,NaN,NaN,NaN